Tekla.Structures.Catalogs.ShapeItemEnumerator
The ShapeItemEnumerator class allows to loop through the shape catalog items.
The following example returns true if an item with the name Connection has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
ShapeItemEnumerator ShapeItemEnumerator = CatalogHandler.GetShapes();
while (ShapeItemEnumerator.MoveNext())
{
ShapeItem ShapeItem = ShapeItemEnumerator.Current as ShapeItem;
if (ShapeItem.Name == "Connection")
{
Result = true;
break;
}
}
}
return Result;
}
}

Tekla.Structures.Catalogs.ShapeItemEnumerator.#ctor
The constructor takes as parameter the filter for which items from the catalog
will enumerate.

Tekla.Structures.Catalogs.ShapeItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Current property required by IEnumerator. The returned object
is always of type ShapeItem.

Tekla.Structures.Catalogs.ShapeItemEnumerator.Current
Returns a shape item instance of the current element.

Tekla.Structures.Catalogs.ShapeItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.ShapeItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.ShapeItemEnumerator.GetSize
Returns the total amount of items.
Returns: The total amount of items.